source _syn.sdc
compile 
report_timing > $current_design.txt
report_area >> $current_design.txt
report_cell >> $current_design.txt
report_power >> $current_design.txt
